{"1":{"name":"Aries","horoscope":"Feb 10, 2018 - Today you're likely to complete a creative project of some kind that you’ve been working on for some time, Aries. You might want to consult with friends or colleagues, get their feedback on what you're doing, and listen to their advice. They may point out both strong and weak points of which you were previously unaware, and this should definitely prove valuable to you. The results you achieve could surprise even you. Go for it!"},"2":{"name":"Taurus","horoscope":"Feb 10, 2018 - Some revealing conversations with friends or relatives could bring up old traumatic memories from the past that you may have been repressing. This could shed light on a lot of obstacles you've been encountering lately, Taurus, and thus enable you to release these emotions and do away with the obstacles. Once that happens, the sky's the limit! Your personal power and self-confidence should be stronger than ever. Go for the gold!"},"3":{"name":"Gemini","horoscope":"Feb 10, 2018 - Today you can expect some noticeable changes in your neighborhood, Gemini. Some new neighbors who might become your friends could be moving in. This could alter your life ever so subtly, turning it in a more positive direction. You could click immediately with these new people, realizing that they share a lot of your interests. Don't overanalyze this situation, but don't write it off as coincidence either. Just make the most of it!"},"4":{"name":"Cancer","horoscope":"Feb 10, 2018 - Efforts to advance your career that have led to past successes might actually put you in the public eye today. You could find yourself the center of attention, Cancer, perhaps sharing your methods with others or leading a discussion group. An opportunity to write or lecture about your experiences could also be in the offing. Expect compliments from a lot of people, which could boost not only your ego but also your enthusiasm."},"5":{"name":"Leo","horoscope":"Feb 10, 2018 - An opportunity to travel could come your way today, Leo, perhaps in the company of friends or colleagues. This might involve education in some way. What you learn on this trip is likely to alter your life somehow, as it could open new doors for you. New friends and valuable contacts could also come on the scene. Don't hesitate; go for it! Another opportunity like this might not come around for a while."},"6":{"name":"Virgo","horoscope":"Feb 10, 2018 - A number of new people could come your way, Virgo, perhaps through projects of some kind with which you're involved. Some of them may appear to be trustworthy and some may not. Today, however, your instincts are highly attuned and you'll be better than usual at sizing up people you don't really know. Make the most of this ability, and don't let logic get in its way. Follow your heart!"},"7":{"name":"Libra","horoscope":"Feb 10, 2018 - The opportunity to attend one or more huge social gatherings, such as balls or banquets, might come your way today, Libra. You might want to attend in the company of a small group of friends. This could be business related or involve a group with which you're affiliated. Nonetheless, it shows the promise of developing into an enlightening experience in one way or another. Accept the invitation and start making your plans!"},"8":{"name":"Scorpio","horoscope":"Feb 10, 2018 - Expect a strong boost to your ego and self-confidence today, Scorpio. Your physical and mental energies are very high, and you're apt to feel that you're capable of moving mountains. Take advantage of this new motivation while you can, since today you could make definite progress on any goal toward which you may be striving. The support and encouragement of friends and colleagues should prove invaluable. Go for the gold!"},"9":{"name":"Sagittarius","horoscope":"Feb 10, 2018 - Today you should feel more energetic, enthusiastic, and motivated than you have in a long time, Sagittarius. You feel very optimistic about your future, thanks to recent successes and support from those closest to you. As a result, your intellectual and creative faculties are more than inspired enough to move forward. The only downside is that there could be so many ideas coming to you that you might not be able to choose among them. Think about each one carefully before going ahead."},"10":{"name":"Capricorn","horoscope":"Feb 10, 2018 - An increased level of physical and mental energy could have you feeling especially determined and highly motivated to move ahead with whatever means the most to you at this time, Capricorn. Matters involving home and family might need some attention right now, though in a very positive way. You'll notice that your inner power is much higher than usual today, as if you could move mountains. Go for it!"},"11":{"name":"Aquarius","horoscope":"Feb 10, 2018 - New opportunities, perhaps involving modern technology in some way, might present themselves to you in such a way as to transform your working life, Aquarius. You could find yourself making a lot of phone calls in this regard, which could keep you busy for much of the day. Your level of excitement is likely to be very high, which makes it important that you remember to take breaks, catch your breath, and definitely get a little exercise."},"12":{"name":"Pisces","horoscope":"Feb 10, 2018 - Changes in your working environment could result in a rise in your income, Pisces. You've been working very hard in order to advance yourself in this regard, and you’re likely to continue to do so indefinitely. Your natural communication skills continue to serve you well, and your physical energy is likely to be stronger than it has been for a long time. The only downside is having very little time to yourself! Hang in there!"}}
